src/InformationRegisters/Scan_ОчередьПоОтправкеПисем/Scan_ОчередьПоОтправкеПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ОчередьПоОтправкеПисем</name>
  <resources>
    <name>ПараметрыОтправки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШаблонПисьма</name>
    <type>
      <types>CatalogRef.Scan_ШаблоныПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтправки</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
      <types>DocumentRef.Scan_ЧекЛистТехническогоСостоянияИзделия</types>
      <types>DocumentRef.Scan_ЗаявкаНаСервисныеРаботы</types>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
      <types>DocumentRef.Scan_ЗаявкаНаОтгрузку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ОчередьПоОтправкеПисем/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("АдминистраторСистемы") ИЛИ НЕ РольДоступна("ПолныеПрава")Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	СтруктураОтбора = Новый Структура("ШаблонПисьма", Запись.ШаблонПисьма);
	СтруктураОтбора.Вставить("ДокументОтправки", Запись.ДокументОтправки);
	СтруктураДанных = РегистрыСведений.Scan_ОчередьПоОтправкеПисем.Получить(СтруктураОтбора);
	
	Если СтруктураДанных.ПараметрыОтправки <> Неопределено Тогда
		ТекТабЗнч = СтруктураДанных.ПараметрыОтправки.Получить();
		Если ТекТабЗнч <> Неопределено Тогда
			Для Каждого ТекСтрока Из ТекТабЗнч Цикл
				СтрокаПараметры = СтрокаПараметры + ТекСтрока.Свойство + ": " + ТекСтрока.Значение + Символы.ПС;
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
